app/Controllers/BaseController.php

    protected function checkRole($requiredRole)
    {
        if (!session()->get('user')) {
            return [
                'isValid' => false,
                'roleDescription' => 'Guest'
            ];
        }

        $user = session()->get('user');

        $referensiModel = new ReferensiModel();
        $roleValid = $referensiModel->where('id', $user['role'])
            ->where('jenis', 1)
            ->where('status', 1)
            ->first();
---
SELECT *
FROM `referensi`
WHERE `id` = '1'
AND `jenis` = 1
AND `status` = 1
 LIMIT 1