app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->get('user')) {
            return redirect()->to('/User/index');
        }

        $user = session()->get('user');

        $roleData = $this->checkRole($user['role']);

        // Inisialisasi model
        $pelangganModel = new PelangganModel();
        $pemakaianModel = new PemakaianModel();

        // Dapatkan bulan dan tahun saat ini
        $currentMonth = date('m');
        $currentYear = date('Y');

        // Hitung Total Pelanggan
        $totalPelanggan = $pelangganModel->countAllResults();

        // Hitung Total Pemakaian Bulan Ini
        $totalPemakaianBulanIni = $pemakaianModel
            ->where('bulan', $currentMonth)
            ->where('tahun', $currentYear)
            ->selectSum('volume')
            ->get()
            ->getRow()
            ->volume;
---
SELECT COUNT(*) AS `numrows`
FROM `pelanggan`
SELECT SUM(`volume`) AS `volume`
FROM `pemakaian`
WHERE `bulan` = '11'
AND `tahun` = '2024'