app/Controllers/Pelanggan.php

    public function inputPemakaian()
    {
        if (!session()->get('user')) {
            return redirect()->to('/User/index');
        }

        $userRole = session()->get('user')['role'];
        if ($userRole !== '2') {
            return redirect()->to('/dashboard')->with('error', 'Anda tidak memiliki akses untuk halaman ini');
        }

        $pelangganModel = new PelangganModel();

        $data = [
            'title' => 'Input Pemakaian',
            'content' => 'Halaman Input Pemakaian',
            'id_pelanggan' => $pelangganModel->findAll(),
---
SELECT *
FROM `pelanggan`

    public function listUsage()
    {
        $PemakaianModel = new PemakaianModel();

        $data = $PemakaianModel->select('pemakaian.*, pelanggan.nama')
            ->join('pelanggan', 'pelanggan.id_pelanggan = pemakaian.id_pelanggan', 'left')
            ->findAll();
---
SELECT `pemakaian`.*, `pelanggan`.`nama`
FROM `pemakaian`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `pemakaian`.`id_pelanggan`

    public function detilPemakaian()
    {
        $id = $this->request->getPost('id');
        $PemakaianModel = new PemakaianModel();

        $data = $PemakaianModel->select('pemakaian.*, pelanggan.nama')
            ->join('pelanggan', 'pelanggan.id_pelanggan = pemakaian.id_pelanggan', 'left')
            ->find($id);
---
SELECT `pemakaian`.*, `pelanggan`.`nama`
FROM `pemakaian`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `pemakaian`.`id_pelanggan`
WHERE `pemakaian`.`id` = '4'

    public function tambahPemakaian()
    {
        if ($this->request->getMethod() !== 'POST') {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Request tidak valid'
            ]);
        }

        $userRole = session()->get('user')['role'];
        if ($userRole !== '2') {
            return redirect()->to('/dashboard')->with('error', 'Anda tidak memiliki akses untuk halaman ini');
        }

        $idPelanggan = $this->request->getPost('id_pelanggan');
        $bulanTahun = $this->request->getPost('tgl_pemakaian');
        $volume = $this->request->getPost('volume');

        $bulan = substr($bulanTahun, 0, 2);
        $tahun = substr($bulanTahun, 3);

        if (empty($idPelanggan) || empty($bulan) || empty($tahun) || empty($volume)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Semua field harus diisi.'
            ]);
        }

        $pemakaianModel = new PemakaianModel();
        $existingPemakaian = $pemakaianModel->where('id_pelanggan', $idPelanggan)
            ->where('bulan', $bulan)
            ->where('tahun', $tahun)
            ->first();
---
SELECT *
FROM `pemakaian`
WHERE `id_pelanggan` = '3'
AND `bulan` = '10'
AND `tahun` = '2024'
 LIMIT 1


        $pemakaianModel = new PemakaianModel();

        if ($pemakaianModel->save($data)) {
---
INSERT INTO `pemakaian` (`id_pelanggan`, `bulan`, `tahun`, `volume`, `created_at`) VALUES ('3', '10', '2024', '100000', '2024-11-27 13:44:26')