app/Controllers/User.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getMethod() !== 'POST') {
            return redirect()->to(base_url('/'));
        }

        $csrfName = csrf_token();
        $csrfHash = $this->request->getVar($csrfName);

        if ($csrfHash !== csrf_hash()) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Invalid CSRF token',
                'csrf_token' => $this->regenerateCSRF()
            ]);
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $referensiModel = new ReferensiModel(); // Inisialisasi model Referensi

        // Ambil user berdasarkan username
        $user = $userModel->where('username', $username)->first();

SELECT *
FROM `referensi`
WHERE `id` = '1'
AND `jenis` = 1
AND `status` = 1
 LIMIT 1
---
        }

        // Cek apakah role user ada di tabel referensi dengan kondisi jenis=1 dan status=1
        $role = $referensiModel->where('id', $user['role'])
            ->where('jenis', 1) // Periksa jenis
            ->where('status', 1) // Periksa status
            ->first();